{
    "name" : "The Mansion",
    "author" : "Allison",
    "intro_text" : "You have been invited to a ritzy party at a mysterious mansion in the countryside. Rumor has it that this house hides a secret that you are determined to discover. You arrive at the place in a town car and depart the vehicle amidst a few other partygoers, all dressed to the nines for the event. Taking a look around you notice the beautiful but slightly unkempt two story house with wings extending far to either side. Taking a deep breath, you prepare to head inside.",
    "start_room" : "driveway",
    "player" : {
        "name" : "Leonardo",
        "inventory" : [],
        "description": "I'm a partyin' fool."
    },
    "rooms" : {
        "driveway" : {
            "description" : "You're in a long driveway filled with fancy cars. Well groomed hedges line either side of the driveway.",
            "exits" : {
                "north" : {
                    "destination" : "main hall",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "To the <i>north</i>, a grand staircase leads up to the front entryway.",
                            "on_enter" : {
                                "description" : "As you approach, the broad wooden doors swing open. A butler clad in an immaculate suit greets you and kindly asks for your invitation. You hand it to him wih a smile and continue into the mansion."
                            }
                        }
                    }
                }
            }
        },
        "main hall" : {
            "description" : "You are in a grand entryway. A sparkling chandellier hangs above a central table with a huge flower arrangement sitting on it. There are small groups and pair of guests chatting along the borders of the room, each holding an hor d'oeuvre or a drink. The butler who took your invitation stands behind you, greting the other guests.",
            "items" : ["flowers"],
            "exits" : {
                "north" : {
                    "destination" : "ballroom",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "To the <i>north</i> lies an impressive curling staircase with gilded railings curling up to the second floor.",
                            "on_enter" : {
                                "description" : "You enter a grand room, only to be nearly blinded by the bright lights and glittering dresses. Once your eyes adjust, you realize that you are in a huge ballroom."
                            }
                        }
                    }
                },
                "east" : {
                    "destination" : "sitting room",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "You notice a door to the <i>east</i> which has intricate, delicate carvings surrounding it. Groups of ladies seem to be heading this way. ",
                            "on_enter" : {
                                "description" : "A group of ladies looks up as you walk in. Eyes seem to follow you as you enter the room and you get the distinct feeling that this is a room for women only."
                            }
                        }
                    }
                },
                "west" : {
                    "destination" : "billiards room",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "To the <i>west</i>, you notice an impressive dark wooden door. Many of the gentlemen at the party seem to be headed in this direction.",
                            "on_enter" : {
                                "description" : "You enter a dark room with many gentlemen lounging around. A few are gathered in the center of the room around an expensive billiards table."
                            }
                        }
                    }
                }
            }
        },
        "billiards room" : {
            "description" : "You are in a dark room with a large billiards table in the center. Many gentlemen lunge around the borders of the room and a few are playing a game of pool in the center.",
            "exits" : {
                "north" : {
                  "destination" : "trophy room",
                  "current_state" : "default",
                  "states" : {
                      "default" : {
                          "description" : "To the <i>north</i> there is a door left slightly ajar. A thin line of cigar smoke escapes from the next room."
                      }
                  }
                },
                "east" : {
                    "destination" : "main hall",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "An impressive wooden door to the main hall lies to the <i>east</i>."
                        }
                    }
                }
            }
        },
        "trophy room" : {
            "description" : "You are in a room thick with cigar smoke. Men sit in heavy leather chairs drinking sophisticated drinks and smoking. A few are gathered near an impressive fireplace on one side.",
            "exits" : {
                "north" : {
                    "destination" : "stables",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "To the <i>north</i> is a nondescript wooden door leading outside."
                        }
                    }
                },
                "south" : {
                    "destination" : "billiards room",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "To the <i>south</i> is a large door, left slightly open, leading to the billiards room."
                        }
                    }
                }
            }
        },
        "stables" : {
            "description" : "You are in a large stable. The amount of money spent building the structure is apparent, but cobwebs in aome corners and a thin layer of dust seem to suggest a lack of use. You hear a couple of horses stamping down the aisle.",
            "exits" : {
                "east" : {
                    "destination" : "cellar main room",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "Just outside the door to the <i>east</i>, you can see a set of stairs leading down to a cellar. The door covering these stairs is slightly ajar, as if inviting you in."
                        }
                    }
                },
                "south" : {
                    "destination" : "trophy room",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "To the <i>south</i>, a nondescript door leads back into the mansion."
                        }
                    }
                }
            }
        },
        "sitting room" : {
            "description" : "You are in a room filled with delicate furniture and pastel fabrics. Ladies in chatter in small groups throughout the room.",
            "exits" : {
                "north" : {
                    "destination" : "portrait hall",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "A wide doorway to the <i>north</i> seems to lead to an impressive hallway."
                        }
                    }
                },
                "east" : {
                    "destination" : "sunroom",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "A glass door to the <i>east</i> leads to a room filled with green plants."
                        }
                    }
                },
                "west" : {
                    "destination" : "main hall",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "A delicate door to the <i>west</i> leads back into the main hall."
                        }
                    }
                }
            }
        },
        "sunroom" : {
            "description" : "You find yourself in a small greenhouse. At one time, it must have held an impressive collection of plants, but now it is very overgrown.",
            "exits" : {
                "north" : {
                    "destination" : "garden",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "To the <i>north</i> lies a door outside."
                        }
                    }
                },
                "west" : {
                    "destination" : "sitting room",
                    "states" : {
                        "default" : {
                            "description" : "A glass dor to the <i>west</i> leads into a delicate sitting room."
                        }
                    }
                }
            }
        },
        "garden" : {
            "description" : "You are in a beautiful garden. There are flowering rosebushes all around, though they are slightly overgrown. Behind the flowers lies a more practical garden that seems to be used to grow fresh food for the kitchen.",
            "exits" : {
                "north" : {
                    "destination" : "kitchen",
                    "current_state" : "default",
                    "states" : {
                        "default" : {
                            "description" : "To the <i>north</i> lies a simple wooden door."
                        }
                    }
                },
                "south" : {
                    "destination" : "sunroom",
                    "current_state" : "default",
                    "states" : {
                        "default" :{
                            "description" : "To the <i>south</i> is a door that leads inside the mansion."
                        }
                    }
                }
            }
        },
        "portrait hall" : {
            "description" : "You enter a long hall with a multitude of portraits spanning generations of the affluent family. However, there doesn't seem to be any recent portraits and a thin layer of dust covers some of the older paintings.",
            "exits" : {
                "north" : {
                    "destination" : "dining hall",
                    "current_state" : "default",
                    "states" : {
                        "default" :{
                            "description" : "To the <i>north</i> lies a glittering doorway with the doors wide open. Indside, you can see many partygoers gathered around a long wooden table stacked with food."
                        }
                    }
                },
                "south" : {
                    "destination" : "sitting room",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "A doorway to the <i>south</i> leads into the pastel sitting room."
                        }
                    }
                }
            }
        },
        "dining hall" : {
            "description" : "You are in a fancy dining room. A long dark wooden table lies in the middle of the room. The table is stacked with many different types of food and each place setting sports a small card with a guest's name printed in looping cursive. Several sparkling chandeliers hang over the table, illuminating the whole room in bright light. Several guests mill around sampling the food on the table and waiters walk amongst them, offering small appetizers.",
            "exits" :{
                "east" :{
                    "destination" : "kitchens",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "A small door to the <i>east</i> seems to lead to the kitchens. Waitstaff rush in and out of the door in a steady stream."
                        }
                    }
                },
                "south" :{
                    "destination" : "portrait hall",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "Glittering doors to the <i>south</i> lead to a long hall."
                        }
                    }
                }
            }
            
        },
        "kitchens" : {
            "description" : "You are in a bustling kitchen. Cooks and waitstaff hurry throughout.",
            "exits" :{
                "south" :{
                    "destination" : "garden",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "To the <i>south</i> lies a small wooden door that leads to the outside."
                        }
                    }
                },
                "west" :{
                    "destination" : "dining hall",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "To the <i>west</i> lies a door to the dining hall. Waiters rush in and out constantly."
                        }
                    }
                }
            }
            
        },
        "ballroom" : {
          "description" : "You are in a huge ballroom filled with women in flowing gowns and men in sharp suits. Pairs of people spin around the dancefloor, while waoters patrol the outskirts offering guests drinks and finger food.",
          "exits" :{
              "north" :{
                  "destination" : "balcony",
                  "current_state" : "default",
                  "states" :{
                      "default" :{
                          "description" : "Huge glass windows to the <i>north</i> open onto a spectacular balcony."
                      }
                  }
              },
              "east" :{
                  "destination" : "east hall",
                  "current_state" : "default",
                  "states" :{
                      "default" :{
                          "description" : "A door to the <i>east</i> leads into the east wing of the building."
                      }
                  }
              },
              "south" :{
                  "destination" : "main hall",
                  "current_state" : "default",
                  "states" :{
                      "default" :{
                          "description" : "A curving staircase to the <i>south</i> leads down into the main hall."
                      }
                  }
              },
              "west" :{
                  "destination" : "west hall",
                  "current_state" : "default",
                  "states" :{
                      "default" :{
                          "description" : "A door to the <i>west</i> leads to the west wing of the building."
                      }
                  }
              }
          }
        },
        "balcony" : {
            "description" : "You step out onto a gorgeous balcony. It provides a spectacular view of the countryside. A few partygoers lean over the railing, enjoying the view.",
            "exits" :{
                "south" :{
                    "destination" : "ballroom",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "Wide glass windows open to the <i>south</i> and allow entry to the ballroom."
                        }
                    }
                }
            }
        },
        "east hall" :{
            "description" : "You are in the long main hall of the east wing. No guests seem to have ventured this far.",
            "exits" :{
                "east" :{
                    "destination" : "ballroom",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "There is a door to the <i>east</i> leading back into the ballroom."
                        }
                    }
                },
                "left" :{
                    "destination" : "bathroom",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : ""
                        }
                    }
                },
                "middle" :{
                    "destination" : "bedroom",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "In the <i>middle</i> of the hall, there is a dark wooden door."
                        }
                    }
                },
                "right" :{
                    "destination" : "dark room",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "To the <i>right</i> there is a small door fitting snugly in its frame."
                        }
                    }
                }
            }
        },
        "bathroom" :{
            "description" : "",
            "exits" :{
                "south" :{
                    "destination" : "east hall",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "To the <i>south</i> is a door leading back into the hall."
                        }
                    }
                }
            }
        },
        "bedroom" :{
            "description" : "You are in a richly adorned bedroom. A large four-posted bed lies in the center of the room. Dark furniture lines the walls and richly colored wallpaper covers them. One window is partially open and the curtains billow in the breeze coming in.",
            "exits" :{
                "south" :{
                    "destination" : "east hall",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "To the <i>south</i> lies the door back into the east hall."
                        }
                    }
                }
            }
        },
        "dark room" :{
            "description" : "You are in a small photography dark room. Red light fills the room and illuminates the chemical bins and a line holding partially developed prints. You squint at them, but cannot make out the subject of the photographs.",
            "exits" :{
                "south" :{
                    "destination" : "east hall",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description": "To the <i>south</i> lies the door back to the east hall"
                        }
                    }
                }
            }
            
        },
        "west hall" :{
            "description" : "You are in a long hall in the west wing. A few guests seem to be wandering around.",
            "exits" :{
                "east" :{
                    "destination" : "ballroom",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "A door to the <i>east</i> leads to the ballroom."
                        }
                    }
                },
                "left" :{
                    "destination" : "antique room",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "A wooden door on the <i>left</i> seems slightly fancier than the others in the hall.",
                            "examination" : "You try the handle only to find that the door is locked.",
                            "open" : "false"
                        }
                    }
                },
                "middle" :{
                    "destination" : "blue room",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "There is a blue door in the <i>middle</i> of the hall."
                        }
                    }
                },
                "right" :{
                    "destination" : "library",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "There is a large door on the <i>right</i>."
                        }
                    }
                }
            }
            
        },
        "antique room" :{
            "description" : "You find yourself in a splendid room filled with antiques.",
            "exits" :{
                "south" :{
                    "destination" : "west hall",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "To the <i>south</i> is the door back to the west hall."
                        }
                    }
                }
            }
            
        },
        "blue room" :{
            "description" : "You are in a room decorated entirely in shades of blue. Fountains of sparkling blue run in the corners of the room. The purpose of such a room escapes you.",
            "exits" :{
                "south" :{
                    "destination" : "west hall",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "A door to the <i>south</i> leads back into the west hall."
                        }
                    }
                }
            }
        },
        "library" :{
            "description" : "You are in a large library. There are more books here than you have ever imagined existed. Some books are open on tables and party guests stand reading them. Other guests gather in corners, looking at the bookshelves or holding heated conversations.",
            "exits" :{
                "south" :{
                    "destination" : "west hall",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "A door to the <i>south</i> leads back into the west hall."
                        }
                    }
                },
                "east" :{
                    "destination" : "tower room",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "A huge bookshelf covers the entire <i>east</i> wall.",
                            "on_enter" : {
                                "description" : "A section of the bookshelf retracts, opening up an entryway into the wall. You find a dark stone staircase winding its way upwards. You decide to follow to stairs to investigate."
                            },
                            "open" : "false"
                        }
                    }
                }
            }
            
        },
        "tower room" :{
            "description" : "You find yourself in a room at the top of a tower. It is illuminated only by the moonlight filtering in through thin windows.",
            "exits" :{
                "south" :{
                    "destination" : "library",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "There is a spiraling staircase to the <i>south</i> leading back down to the library."
                        }
                    }
                }
            }
        },
        "cellar main room" : {
            "description" : "You are in a cool dark cellar room. Several barrels sit in the corners and water drips from one corner, forming a small puddle on the ground.",
            "exits" :{
                "north" :{
                    "destination" : "root cellar",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "A doorway to the <i>north</i> leads to another dark room."
                        }
                    }
                },
                "east" :{
                    "destination" : "storage closet",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "A doorway to the <i>east</i> leads to what seems to be a storage room."
                        }
                    }
                },
                "west" :{
                    "destination" : "stables",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "Stairs to the <i>west</i> lead to the stables."
                        }
                    }
                }
            }
        },
        "root cellar" :{
            "description" : "You are in a dark room filled with piles of fruits and vegetables. It seems to be the mansion's root cellar.",
            "exits" :{
                "south" :{
                    "destination" : "cellar main room",
                    "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "A doorway to the <i>south</i> leads to the main cellar room"
                        }
                    }
                }
            }
            
        },
        "storage closet" :{
           "description" : "You find yourself in a small, cold storage room. There are shelves of cleaning products and mops and brooms line most of the walls.",
           "exits" :{
               "east" :{
                   "destination" : "treasure room",
                   "current_state" : "default",
                   "states" :{
                       "default" :{
                           "description" : "There is a curious blank space on the <i>east</i> side of the room. There doesn't seem to be anything there at the moment.",
                           "open" : "false"
                       }
                   }
               },
               "west" :{
                   "destination" : "cellar main room",
                   "current_state" : "default",
                   "states" :{
                       "default" :{
                           "description" : "There is a door to the <i>west</i> leading back into the cellar main room."
                       }
                   }
               }
           }
        },
        "treasure room" :{
            "description" : "You find yourself in a small room. It is pretty unremarkable except for the large chest in the back.",
            "exits":{
               "west" :{
                   "destination" : "storage room",
                   "current_state" : "default",
                    "states" :{
                        "default" :{
                            "description" : "There is a door to the <i>west</i> leading back into the storage closet."
                        }
                    }
                }
            }
        }
    },
    "items" : {
        "flowers" : {
            "current_state" : {
                "default" : {
                    "description" : "On a table you can see a nice arrangement of <i>flowers</i>.",
                    "examination" : "They smell quite nice."
                }
            }
        }
    }
}